# Pandas `axis` parameter

This is a notebook for the medium article [Pandas `axis` parameter](https://bindichen.medium.com/all-pandas-qcut-you-should-know-for-binning-numerical-data-based-on-sample-quantiles-c8b13a8ed844)

Please check out article for instructions

**License**: [BSD 2-Clause](https://opensource.org/licenses/BSD-2-Clause)

* https://railsware.com/blog/python-for-machine-learning-pandas-axis-explained/
* https://towardsdatascience.com/10-quick-numpy-tricks-that-will-make-life-easier-for-a-data-scientist-35a0253c7479
* https://www.youtube.com/watch?v=PtO3t6ynH-8
* https://towardsdatascience.com/4-must-know-parameters-in-python-pandas-6a4e36f6ddaf


The axis parameter is used for choosing the axis for the function to be applied. 0 is for the index and 1 is for the columns. The default value is usually 0. I have never used a function with a default axis parameter value of 1.
Consider the sum function. When we apply it to a dataframe, it calculates the sum of the values along the rows or columns.

When the axis is 0, the sum operation is done along the index so the output gives the column sums. When the axis is 1, rows sums are calculated.
The axis is a valid parameter for a lot of functions such as mean, sort_values, groupby, fillna, dropna, rank, and so on.

In [1]:
import pandas as pd

In [2]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [3]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [4]:
#

In [6]:
drinks.drop('continent', axis=1).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [8]:
drinks.drop(2, axis=0).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
5,Antigua & Barbuda,102,128,45,4.9,North America

In [10]:
drinks.mean(axis=0)

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

In [11]:
drinks.mean(axis=1)

0        0.000
1       69.975
2        9.925
3      176.850
4       81.225
        ...
188    110.925
189     29.000
190      1.525
191     14.375
192     22.675
Length: 193, dtype: float64

count()
diff()
filter()
rename()
truncate()
dropna()

## 
* apply()
* drop()

## Direction 
* mean, max, min, std, sum, medium, mad etc
* concat()
* shift()
* append()